#include <iostream>
#include <cmath>
using namespace std;

int main() 
{
    
    // Оголошення змінної для тризначного числа
    int number, hundreds, tens, units, newNumber;

    // Введення тризначного числа
    cout << "Integer15: ";
    cout << "Введіть тризначне число: ";
    cin >> number;

    // Виділення сотень, десятків та одиниць
    hundreds = number / 100;          // Отримуємо сотні
    tens = (number / 10) % 10;        // Отримуємо десятки
    units = number % 10;              // Отримуємо одиниці

    // Перестановка сотень та десятків
    newNumber = tens * 100 + hundreds * 10 + units;

    // Виведення нового числа
    cout << "Число після перестановки сотень та десятків: " << newNumber << endl;

    // Оголошення змінних для чисел A та B
    int A, B;

    // Введення чисел A та B
    cout << "Boolean19: ";
    cout << "Введіть число A: ";
    cin >> A;
    cout << "Введіть число B: ";
    cin >> B;

    // Перевірка, чи є хоча б одне число непарним
    if (A % 2 != 0 || B % 2 != 0) 
    {
        cout << "Істинно: хоча б одне з чисел A або B непарне." << endl;
    } 
    else 
    {
        cout << "Помилково: обидва числа парні." << endl;
    }
    // Номер виразу 5
    // Для математичних функцій

    // Оголошення змінних
    double x, y;
    const double log5_2 = log(2) / log(5);  // обчислення логарифму на підставі 5 від 2

    // Введення значення x
    cout << "Номер виразу 5: ";
    cout << "Введите значение x: ";
    cin >> x;

    // Обчислення значення функціїy
    y = (5 * pow(3, x) * sqrt(exp(x) * fabs(sin(27 * M_PI / 180 + x)))) / (log5_2 * fabs(x));

    // Висновок результату
    cout << "Значение функции y: " << y << endl;

    return 0;
}